{
  "_name_or_path": "klue/roberta-base",
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "a_med_rec",
    "1": "a_eco_bg",
    "2": "a_crim_rec",
    "3": "prep_act",
    "4": "a_mental_con",
    "5": "motive",
    "6": "crime_method",
    "7": "reason_incmpl",
    "8": "v_injury",
    "9": "crime_result",
    "10": "nan"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "a_crim_rec": 2,
    "a_eco_bg": 1,
    "a_med_rec": 0,
    "a_mental_con": 4,
    "crime_method": 6,
    "crime_result": 9,
    "motive": 5,
    "nan": 10,
    "prep_act": 3,
    "reason_incmpl": 7,
    "v_injury": 8
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "tokenizer_class": "BertTokenizer",
  "torch_dtype": "float32",
  "transformers_version": "4.41.2",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 32000
}
